In [77]:
import pandas as pd

Há mais casamento entre homens ou entre mulheres no Brasil?

In [78]:
df = pd.read_csv('lgbt_casamento.csv')
df.head()

    ano        uf     genero        mes  numero
0  2014  Rondônia  Masculino    Janeiro       0
1  2014  Rondônia  Masculino  Fevereiro       0
2  2014  Rondônia  Masculino      Março       0
3  2014  Rondônia  Masculino      Abril       0
4  2014  Rondônia  Masculino       Maio       0

In [79]:
meses = {
    'Janeiro': 1,
    'Fevereiro': 2,
    'Março': 3,
    'Abril': 4,
    'Maio': 5,
    'Junho': 6,
    'Julho': 7,
    'Agosto': 8,
    'Setembro': 9,
    'Outubro': 10,
    'Novembro': 11,
    'Dezembro': 12
}

In [80]:
df['mes'] = df['mes'].apply(lambda x: meses[x])

In [81]:
df['data'] = pd.to_datetime(df['mes'].astype(str) + '-' + df['ano'].astype(str))

In [83]:
df2 = df.groupby(['data', 'genero']).agg({'numero': 'sum'})
df2.head(10)

                      numero
data       genero
2013-01-01 Feminino       39
           Masculino      35
2013-02-01 Feminino       49
           Masculino      61
2013-03-01 Feminino       87
           Masculino      73
2013-04-01 Feminino      124
           Masculino      97
2013-05-01 Feminino      128
           Masculino     107

Resposta: Mulheres